src_ext/DataProcessors/УЗ_ОтправкаСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УЗ_ОтправкаСообщения</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ЖурналРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ЖурналРассылки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Адреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_СтатусыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ученик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_КаналыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/DataProcessors/УЗ_ОтправкаСообщения/Forms/Форма/Ext/Form/Module.bsl
//Сообщение ученику вручную (менеджер, руководитель): кому уйдёт — ученик и плательщики с согласием, каждый своим
//каналом (УЗ_Сообщения.Получатели); отправка — УЗ_Сообщения.ОтправитьВручную, каждая попытка — в журнале
//сообщений. Открывается из карточки ученика (параметр Ученик) или из раздела «Касса».

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Ученик") И ЗначениеЗаполнено(Параметры.Ученик) Тогда
		Ученик = Параметры.Ученик;
	КонецЕсли;
	Тема = НСтр("ru = 'Сообщение из студии'");
	ЗаполнитьПолучателей();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УченикПриИзменении(Элемент)

	ЗаполнитьПолучателей();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отправить(Команда)

	Если Не ЗначениеЗаполнено(Ученик) Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Выберите ученика.'"), "Ученик");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(Текст) И ПустаяСтрока(КраткийТекст) Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Напишите текст сообщения.'"), "Текст");
		Возврат;
	КонецЕсли;
	ОтправитьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурнал(Команда)

	ОткрытьФорму("РегистрСведений.УЗ_ЖурналРассылки.ФормаСписка", , ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Кому уйдёт сообщение: «Имя — канал: адрес» или почему нет; в «Состоянии» — сколько получателей.
&НаСервере
Процедура ЗаполнитьПолучателей()

	Получатели.Очистить();
	Если Не ЗначениеЗаполнено(Ученик) Тогда
		Состояние = НСтр("ru = 'Выберите ученика — появится, кому и каким каналом уйдёт сообщение.'");
		Возврат;
	КонецЕсли;
	Можно = 0;
	Для Каждого Получатель Из УЗ_Сообщения.Получатели(Ученик) Цикл
		НоваяСтрока = Получатели.Добавить();
		НоваяСтрока.Представление = Получатель.Представление
			+ ?(Получатель.МожноПисать И Не ПустаяСтрока(Получатель.Причина), " (" + Получатель.Причина + ")", "");
		НоваяСтрока.МожноПисать = Получатель.МожноПисать;
		Можно = Можно + ?(Получатель.МожноПисать, 1, 0);
	КонецЦикла;
	Состояние = ?(Можно = 0, НСтр("ru = 'Некому:'") + " " + УЗ_Сообщения.ТекстНекому() + ".",
		СтрШаблон(НСтр("ru = 'Получателей: %1.'"), Можно));

КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()

	Итог = УЗ_Сообщения.ОтправитьВручную(Ученик, Тема, Текст, КраткийТекст);
	Если Итог.Получателей = 0 Тогда
		Состояние = НСтр("ru = 'Не отправлено:'") + " " + Итог.ТекстОшибки + ".";
	ИначеЕсли Итог.ОтправленоВсем Тогда
		Состояние = СтрШаблон(НСтр("ru = 'Отправлено получателям: %1 (%2).'"), Итог.Получателей,
			Формат(ТекущаяДатаСеанса(), "ДФ=HH:mm"));
	Иначе
		Состояние =
			СтрШаблон(НСтр("ru = 'Отправлено не всем: %1. Подробности — в журнале сообщений.'"), Итог.ТекстОшибки);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
